Repository: naaando/lyrics
Catalog: po/extra/*.po
Languages: pt

source: Lyrics displayer
pt: Exibe letras de música

source: The styleful way to sing your songs
pt: A maneira com estilo para cantar as suas músicas

source: lyrics;music;
pt: lyrics;letras;music;música;

source: The beautiful way to sing your songs
pt: A maneira bonita para cantar as suas músicas

source: Lyrics is an application that displays lyrics for songs you are listening to, it query the song through MPRIS protocol, search, downloads the lyric file and display it scrolling syncronized.
pt: O Lyrics é uma aplicação que exibe letras de músicas para as canções que estiver a ouvir. Ele consulta a música através do protocolo MPRIS, procura, transfere e exibe o ficheiro de letra de forma sincronizada deslizando para baixo.

source: Ported viewlwyrics source
pt: Fonte viewlwyrics transferida

source: Fixes file saving when the directory to save don't exists
pt: Correção ao guardar quando a diretoria para guardar não existe

source: Fix bug where selecting a lyric from the search dialog don't display it
pt: Correção de um problema em que a letra não era exibida ao seleciona-la no dialogo de procura

source: Fix bug where the lyrics start to overlap
pt: Correção de um problema em que as letras começavam a sobrepor-se

source: Remove legacy code for old lyric displayers
pt: Código antigo removido para exibidores antigos de letras

source: Fix warnings related to custom font provider
pt: Correção de avisos relacionados com o fornecedor de fontes personalizáveis

source: Fix warnings related to ClickThroughHelper
pt: Correção de avisos relacionados com o ClicarAtravésAjudante

source: (Contribuition by Torikul Habib) Fix a bug where the window increases the minimum width on backdrop.
pt: (Contribuição por Torikul Habib) Corrigido um problema em que a janela aumentava a largura mínima do pano de fundo.

source: Update translation files
pt: Atualização de ficheiros de tradução

source: Fix error where a searched lyric is not displayed if lyrics wasn't displaying already
pt: Corrigido um erro em que a letra de música encontrada não era exibida se a mesma não estivesse já a ser exibida

source: Fix repositories returning null collections
pt: Correção de repositórios a retornar coleções nulas

source: Fix settings popover menu closing on click
pt: Correção do menu flutuante de definições ao fechar com um clique

source: Adds ghost mode:
pt: Modo fantasma adicionado:

source: Let clicks pass through the window when it is translucid
pt: Deixar passar cliques através da janela quando esta estiver translucida

source: Hide headerbar widgets when the app goes backdrop
pt: Esconder a barra de topo dos widgets quando a aplicação passar a pano de fundo

source: Makes headerbar clickable on ghost mode to drag and to grab focus
pt: Faz com que a barra de topo seja clicável no modo fantasma para arrastar e agarrar o foco

source: Add lyric search
pt: Procura de letras de música adicionada

source: Remove Cairo dependency
pt: Dependência Cairo removida

source: Remove Granite dependency
pt: Dependência Granite removida

source: Reduce spacing spent on margins and borders
pt: Espaço das margens e bordas reduzidas

source: Saves window's width and height properties now
pt: Grava agora as propriedades da largura e altura da janela

source: Under the hood code improvements
pt: Melhorias do código

source: Reset font on restore settings
pt: Restaura fontes ao restaurar as definições

source: Make possible to choose custom fonts
pt: Faz com que seja possível escolher fontes personalizáveis

source: Make the app translatable
pt: Faz com que a aplicação seja traduzível

source: Add brazillian portuguese translation
pt: Tradução Português do Brasil adicionada

source: Add french translation
pt: Tradução Francesa adicionada

source: Fixes for packaging to flatpak
pt: Correções do pacote flatpack

source: Fix when playing setting
pt: Correção da definição ao tocar

source: Fixes lyric parsing
pt: Correção da análise de letras de músicas

source: Fix play and pause icons on player control button
pt: Correção dos ícones tocar e pausar no botão de controlo do leitor

source: Fix error where lyrics don't stop after closing the player
pt: Correção de um erro em que as letras de músicas não paravam depois de fechar o leitor

source: A major rewrite of the application
pt: Uma grande reescrita da aplicação

source: Fix lyrics sorting problem
pt: Correção de um problema na organização das letras de música

source: Fix crashes on compact timestamps format: [mm:ss]
pt: Correção de falhas em formatos compactos de marca temporal: [mm:ss]

source: Lyrics now scroll on the center of window
pt: As letras de música agora descem para baixo no centro da janela

source: Initial release
pt: Lançamento inicial
