Repository: naaando/lyrics
Catalog: po/*.po
Languages: fr, nl

source: Lyrics displayer
fr: Afficheur de paroles
nl: Songtekstweergave

source: The styleful way to sing your songs
fr: La plus belle façon de chanter vos chansons
nl: De stijlvolle manier om je nummers mee te zingen

source: lyrics;music;
fr: paroles;musique;
nl: songtekst;muziek;

source: The beautiful way to sing your songs
fr: La plus belle façon de chanter vos chansons
nl: De stijlvolle manier om je nummers mee te zingen

source: Lyrics is an application that displays lyrics for songs you are listening to, it query the song through MPRIS protocol, search, downloads the lyric file and display it scrolling syncronized.
fr: Lyrics est une application qui affiche les paroles des chansons que vous écoutez, il interroge la chanson à travers le protocole MPRIS, recherche, télécharge le fichier des paroles et l'affiche en défilement synchronisé.
nl: Lyrics is een app die songteksten toont als je een nummer luistert. Het nummer wordt opgevraagd middels het MPRIS-protocol. Daarna wordt de songtekst gezocht en gedownload en vervolgens gesynchroniseerd getoond.

source: Ported viewlwyrics source
fr: Portage de la source viewlwyrics

source: Fixes file saving when the directory to save don't exists
fr: Correction de l'enregistrement d'un fichier lorsque le répertoire à enregistrer n'existe pas

source: Fix bug where selecting a lyric from the search dialog don't display it
fr: Correction d'un bug où la sélection d'un texte dans la boîte de dialogue de recherche ne l'affiche pas.

source: Fix bug where the lyrics start to overlap
fr: Correction d'un bug où les paroles commencent à se chevaucher

source: Remove legacy code for old lyric displayers
fr: Suppression de l'ancien code pour les anciens afficheurs de paroles

source: Fix warnings related to custom font provider
fr: Correction des avertissements liés à la personnalisation des polices

source: Fix warnings related to ClickThroughHelper
fr: Correction des avertissements liés à ClickThroughHelper

source: (Contribuition by Torikul Habib) Fix a bug where the window increases the minimum width on backdrop.
fr: (Contribution de Torikul Habib) Correction d'un bug où la fenêtre augmente la largeur minimale en arrière-plan.

source: Update translation files
fr: Mise à jour des fichiers de traduction

source: Fix error where a searched lyric is not displayed if lyrics wasn't displaying already
fr: Correction d'une erreur où un texte recherché n'était pas affiché si les paroles ne s'affichaient pas déjà.
nl: Fout opgelost als een opgevraagde songtekst niet getoond werd

source: Fix repositories returning null collections
fr: Correction des dépôts renvoyant des collections nulles
nl: Probleem met bronnen opgelost die null-verzamelingen aangaven

source: Fix settings popover menu closing on click
fr: Correction du menu contextuel des paramètres se fermant au clic
nl: Probleem opgelost met sluiten van instellingenmenu bij klikken

source: Adds ghost mode:
fr: Ajout du mode fantôme :
nl: Spookmodus toegevoegd:

source: Let clicks pass through the window when it is translucid
fr: Laisse passer les clics à travers la fenêtre lorsqu'elle est translucide
nl: Kliks worden buiten het venster gerekend als het doorzichtig is

source: Hide headerbar widgets when the app goes backdrop
fr: Cache les widgets de la barre supérieure lorsque l'application passe en arrière-plan
nl: Verbergt de headerbarwidgets als de app naar het bureaublad gaat

source: Makes headerbar clickable on ghost mode to drag and to grab focus
fr: Permet de cliquer sur la barre supérieure en mode fantôme pour faire glisser et mettre au premier plan
nl: Maakt de headerbar aanklikbaar in spookmodus om focus op te eisen

source: Add lyric search
fr: Ajout de la recherche des paroles
nl: Zoekfunctie toegevoegd

source: Remove Cairo dependency
fr: Suppression de la dépendance Cairo
nl: Cairo-afhankelijkheid verwijderd

source: Remove Granite dependency
fr: Supression de la dépendance Granite
nl: Granite-afhankelijkheid verwijderd

source: Reduce spacing spent on margins and borders
fr: Réduction de l'espacement des marges et des bordures
nl: Ruimte verminderd tussen randen

source: Saves window's width and height properties now
fr: Sauvegarde désormais les propriétés de largeur et de hauteur de la fenêtre
nl: Onthoudt nu de venstereigenschappen voor breedte en hoogte

source: Under the hood code improvements
fr: Amélioration du code en interne
nl: Verbeteringen onder de motorkap

source: Reset font on restore settings
fr: Réinitialisez la police dans les paramètres de réinitialisation
nl: Lettertype wordt hersteld bij terugzetten van instellingen

source: Make possible to choose custom fonts
fr: Permet de choisir des polices personnalisées
nl: Mogelijkheid toegevoegd voor het kiezen van aangepaste lettertypen

source: Make the app translatable
fr: L'application peut désormais être traduite
nl: App vertaalbaar gemaakt

source: Add brazillian portuguese translation
fr: Ajout des traductions en portugais brésilien
nl: Braziliaans-Portugese vertaling toevoegd

source: Add french translation
fr: Ajout des traductions en français
nl: Franse vertaling toegevoegd

source: Fixes for packaging to flatpak
fr: Correction pour la mise en paquet pour flatpak
nl: Problemen opgelost met Flatpak-pakketten

source: Fix when playing setting
fr: Correction des paramètres de lecture
nl: Afspeelinstelling gerepareerd

source: Fixes lyric parsing
fr: Correction de la récupération des paroles
nl: Songtekstverwerking gerapereerd

source: Fix play and pause icons on player control button
fr: Correction des contrôles de lecture et de mise en pause
nl: Bedieningsknoppen op speler gerepareerd

source: Fix error where lyrics don't stop after closing the player
fr: Correction d'une erreur ou les paroles ne s'arrêtaient pas après avoir fermé le lecteur
nl: Fout opgelost waarbij songteksten niet werden stopgezet na het sluiten van de speler

source: A major rewrite of the application
fr: Réecriture majeure de l'application
nl: App volledig opnieuw in elkaar gezet

source: Fix lyrics sorting problem
fr: Correction d'un problème de tri des paroles
nl: Songtekstsorteerprobleem opgelost

source: Fix crashes on compact timestamps format: [mm:ss]
fr: Correction de plantage avec les formats de date compacts : [mm:ss]
nl: Crashes bij compacte tijdweergave opgelost: [mm:ss]

source: Lyrics now scroll on the center of window
fr: Les paroles défilent désormais au centre de la fenêtre
nl: Songteksten schuiven nu gecentreerd

source: Initial release
fr: Version initiale
nl: Initiale uitgave

source: Couldn't find any player, check your player's MPRIS configuration
fr: Impossible de trouver un lecteur, vérifiez la configuration MPRIS de votre lecteur
nl: Geen speler aangetroffen; controleer de MPRIS-configuratie van je speler

source: Currently not playing
fr: Pas de lecture en cours
nl: Er wordt momenteel niks afgespeeld

source: Couldn't find lyrics for song
fr: Pas de paroles trouvées pour cette chanson
nl: Geen songtekst gevonden bij nummer

source: Downloading
fr: Téléchargement
nl: Bezig met downloaden...

source: Light background
fr: Thème clair
nl: Lichte achtergrond

source: Dark background
fr: Thème sombre
nl: Donkere achtergrond

source: Close
fr: Fermer
nl: Sluiten

source: Search
fr: Rechercher
nl: Zoeken

source: Title:
fr: Titre :
nl: Titel:

source: Artist:
fr: Artiste :
nl: Artiest:

source: Select custom font:
fr: Sélectionner une police personnalisée :
nl: Kies een aangepast lettertype:

source: Lyrics download folder:
fr: Dossier de téléchargement des paroles :
nl: Downloadmap voor songteksten:

source: Select folder to download lyrics
fr: Sélectionner le dossier dans lequel télécharger les paroles
nl: Kies de map waarin songteksten moeten worden opgeslagen

source: Couldn't add default lyrics folder to FileChooserButton
fr: Impossible d'ajouter le dossier des paroles par défaut au bouton de choix du fichier
nl: Kan standaard songtekstmap niet toevoegen aan FileChooserButton

source: Keep window above:
fr: Conserver la fenêtre au premier plan :
nl: Venster bovenop:

source: Always
fr: Toujours
nl: Altijd

source: When playing
fr: Pendant de la lecture
nl: Tijdens afspelen

source: Never keep above
fr: Jamais
nl: Nooit bovenop houden

source: Make translucid on focus loss
fr: Rendre translucide lorsque l'application n'est plus au premier plan
nl: Doorzichtig maken bij verliezen van focus

source: Restore default settings
fr: Restaurer les paramètres par défaut
nl: Standaardinstellingen herstellen

source: by
fr: par
nl: door

source: Unknown artist
fr: Artiste inconnu
nl: Onbekende artiest

source: Unknown title
fr: Titre inconnu
nl: Onbekende titel
